import numpy as np

def dpf(t, y, P):
    # t[0]=x1, t[1]=x2, t[2]=T
    x1, x2, T = t
    
    # 평형 관계식 계산
    P1 = 10**(7.62231 - 1417.9 / (191.15 + T))
    P2 = 10**(8.10765 - 1750.29 / (235 + T))
    
    gam1 = 10**(1.7 * x2**2 / ((2.43 * x1 + x2)**2))
    gam2 = 10**(0.7 * x1**2 / ((x1 + 0.412 * x2)**2))
    
    k1 = gam1 * P1 / P
    k2 = gam2 * P2 / P
    
    # 비선형 방정식 반환
    f = np.array([
        x1 - y[0] / k1,
        x2 - y[1] / k2,
        x1 + x2 - 1
    ])
    return f